# coding=utf-8
import networkx as nx
import pandas as pd
import csv
import datetime
import networkx as nx
import numpy as np
import pandas as pd
# coding=utf-8
from matplotlib import pyplot as plt
from matplotlib.font_manager import FontProperties
from matplotlib.ticker import FuncFormatter, MaxNLocator

"""
# 处理阈值分段
"""
# 画折线图
def drawLineChart(X_ValueList, Y_ValueList, X_Name, Y_name, pic_Name,pic_Example):
    """
    :param X_ValueList: 横坐标值列表
    :param Y_ValueList: 纵坐标值列表
    :param X_Name: X轴名称
    :param Y_name: Y轴名称
    :param pic_Name: 图片名称
    :return:
    """
    # 画图 设置X轴显示效果
    fig = plt.figure()
    ax = fig.add_subplot(111)

    # 为了设置x轴时间的显示
    def format_fn(tick_val, tick_pos):
        if int(tick_val) in range(len(X_ValueList)):
            return X_ValueList[int(tick_val)]
        else:
            return ''

    ax.xaxis.set_major_formatter(FuncFormatter(format_fn))
    ax.xaxis.set_major_locator(MaxNLocator(integer=True))

    # plt.ylim((-5, 40))
    # 横坐标每个值旋转90度
    # plt.xticks(rotation=90)
    # 设置Mac上的字体
    # font = FontProperties(fname='/Library/Fonts/Arial Unicode.ttf')
    # win（大壳子上跑数据的字体）
    font = FontProperties(
        fname='C:\\Windows\\WinSxS\\amd64_microsoft-windows-font-truetype-arial_31bf3856ad364e35_10.0.19041.1_none_28747db34cb89a67\\arial.ttf')
    # 坐标轴ticks的字体大小
    # 设置x轴刻度
    # plt.xticks([0, 0.2, 0.4, 0.6, 0.8, 1])
    # 设置y轴刻度
    # plt.yticks([0, 0.2, 0.4, 0.6, 0.8, 1])
    plt.tick_params(labelsize=5)
    plt.xlabel(X_Name, FontProperties=font)
    plt.ylabel(Y_name, FontProperties=font)
    plt.title(pic_Name, FontProperties=font)
    # 打出图例
    plt.legend(pic_Example)
    ax.plot(X_ValueList, Y_ValueList)

    ax.plot(X_ValueList, Y_ValueList)
    plt.show()


datawantdel = pd.read_csv("F:\\01大连民族\\百度迁徙爬取和数据\\百度迁徙数据-final\\in\\20200101.csv")
import numpy as np

# 最大连通性组件值
lagestCompontValue = []
# 最大连通性城市列表
lagestCompontCityValue = []
# 阈值列表
thresholdValue = np.arange(0, 0.25, 0.01)


for i in range(24):
    # 循环每一行
    G = nx.Graph()
    for j in range(datawantdel["city_name"].count()):
        dataFormatCol = datawantdel.loc[j]
        # 判断是否在阈值区间
        if thresholdValue[i] <= float(dataFormatCol[2]) <= thresholdValue[i+1]:
            G.add_edges_from([(dataFormatCol[0], dataFormatCol[1])])
        #     # 获取到索引
        #     indexNumber = datawantdel[(datawantdel.city_name == dataFormatCol[0]) & (datawantdel.city_id_name == dataFormatCol[1])].index.tolist()[0]
        #     # 删除数据
        #     datawantdel.drop(indexNumber, axis=0, inplace=True)
        #     print("删除数据，",indexNumber)
        # #重置索引
        # datawantdel = datawantdel.reset_index(drop=True)



    # 最大连通性组件城市
    largest_cc = max(nx.connected_components(G), key=len)
    lagestCompontCityValue.append(largest_cc)
    lagestCompontValue.append(len(largest_cc))

print("最大连通性城市有哪些",lagestCompontCityValue)
print("最大连通性值",lagestCompontValue)
print("阈值列表",thresholdValue)

# S = [G.subgraph(c).copy() for c in nx.connected_components(G)]
# print("连通分量：", len(S))
# for subgraphValue in S:
#     print(subgraphValue)

listnodes=[]
for subgraphValue in S:
    listnodes.append(len(subgraphValue.nodes()))
print(listnodes)
# [20200, 20199]
# drawLineChart(thresholdValue,lagestCompontValue,"阈值","最大连通性组件值","20200101根据最大连通性折线图","最大连通性")

# 最大连通性值 [377, 329, 247, 179, 124, 43, 16, 14, 7, 8, 12, 10, 5, 5, 4, 4, 3, 3, 3, 3, 3, 3, 3, 2]
# 最大连通性城市有哪些 [{'本溪', '达州', '甘南藏族自治州', '文山壮族苗族自治州', '泸州', '威海', '玉树藏族自治州', '屯昌县', '九江', '合肥', '娄底', '舟山', '固原', '朔州', '白城', '保定', '塔城地区', '开封', '承德', '双河', '嘉峪关', '襄樊', '孝感', '惠州', '永州', '北屯', '雅安', '乌海', '苏州', '通辽', '大连', '湛江', '湘潭', '衡阳', '阳泉', '肇庆', '嘉兴', '齐齐哈尔', '桃园', '台湾', '石家庄', '通什', '定安县', '郑州', '德州', '上海', '枣庄', '吐鲁番', '漳州', '保亭黎族苗族自治县', '潮州', '临沧', '云浮', '武威', '马鞍山', '西宁', '芜湖', '鹰潭', '锡林郭勒盟', '金华', '桂林', '温州', '德宏傣族景颇族自治州', '绥化', '三明', '新乡', '东莞', '扬州', '朝阳', '廊坊', '张家界', '安阳', '眉山', '台北', '乐山', '岳阳', '阜新', '南阳', '大理白族自治州', '汕头', '赣州', '铜陵', '昌吉回族自治州', '黄南藏族自治州', '深圳', '六安', '南昌', '宜昌', '亳州', '自贡', '保山', '黔东南苗族侗族自治州', '陵水黎族自治县', '昌都', '玉溪', '成都', '黄山', '蚌埠', '河池', '日照', '营口', '泰州', '贵阳', '七台河', '酒泉', '澄迈县', '怀化', '呼和浩特', '淮安', '伊春', '阜阳', '鹤岗', '天津', '延边朝鲜族自治州', '郴州', '六盘水', '大兴安岭地区', '澳门', '宁德', '丽水', '荆州', '邢台', '迪庆藏族自治州', '昭通', '黑河', '北海', '葫芦岛', '鹤壁', '果洛藏族自治州', '丽江', '天门', '高雄', '常州', '商丘', '乌鲁木齐', '中山', '拉萨', '鄂州', '贺州', '绍兴', '佳木斯', '襄阳', '南京', '淮南', '滁州', '百色', '西安', '渭南', '资阳', '张掖', '宜宾', '阳江', '神农架林区', '德阳', '巴音郭楞蒙古自治州', '信阳', '来宾', '儋州', '许昌', '仙桃', '天水', '琼中黎族苗族自治县', '江门', '厦门', '哈密', '台中', '阿拉善盟', '邵阳', '衢州', '南充', '丹东', '泉州', '常德', '汕尾', '烟台', '四平', '黔西南布依族苗族自治州', '梧州', '临沂', '黔南布依族苗族自治州', '哈尔滨', '盘锦', '定西', '昆玉', '台州', '连云港', '大同', '盐城', '安庆', '潍坊', '莆田', '金昌', '咸宁', '咸阳', '重庆', '那曲', '佛山', '东方', '焦作', '衡水', '广州', '张家口', '宿迁', '崇左', '潜江', '红河哈尼族彝族自治州', '东营', '乐东黎族自治县', '珠海', '湖州', '白沙黎族自治县', '忻州', '北京', '景德镇', '克拉玛依', '濮阳', '宝鸡', '海口', '杭州', '漯河', '商洛', '吴忠', '绵阳', '山南', '海东', '西双版纳傣族自治州', '南通', '无锡', '济南', '随州', '吕梁', '龙岩', '鞍山', '韶关', '周口', '遵义', '松原', '赤峰', '思茅', '新余', '太原', '清远', '黄冈', '防城港', '通化', '海北藏族自治州', '伊犁哈萨克自治州', '克孜勒苏柯尔克孜自治州', '阿克苏地区', '新北', '玉林', '香港', '铁岭', '昌江黎族自治县', '昆明', '聊城', '铁门关', '五家渠', '日喀则', '驻马店', '菏泽', '池州', '三门峡', '曲靖', '巴中', '株洲', '淮北', '阿坝藏族羌族自治州', '上饶', '泰安', '晋中', '安顺', '榆林', '石河子', '长治', '内江', '普洱', '遂宁', '鸡西', '海南藏族自治州', '宁波', '白山', '大庆', '钦州', '晋城', '牡丹江', '石嘴山', '十堰', '汉中', '延安', '吉安', '贵港', '恩施土家族苗族自治州', '辽阳', '博尔塔拉蒙古自治州', '镇江', '宣城', '毕节', '揭阳', '茂名', '宜春', '南平', '庆阳', '梅州', '兰州', '广安', '抚州', '荆门', '怒江傈僳族自治州', '湘西土家族苗族自治州', '沧州', '秦皇岛', '青岛', '滨州', '琼海', '宿州', '包头', '铜川', '攀枝花', '巴彦淖尔', '鄂尔多斯', '甘孜藏族自治州', '三亚', '凉山彝族自治州', '长春', '徐州', '抚顺', '安康', '辽源', '万宁', '图木舒克', '临夏回族自治州', '海西蒙古族藏族自治州', '沈阳', '南宁', '洛阳', '铜仁', '陇南', '白银', '福州', '兴安盟', '运城', '萍乡', '黄石', '唐山', '喀什地区', '武汉', '平凉', '阿勒泰地区', '楚雄彝族自治州', '林芝', '淄博', '可克达拉', '文昌', '阿拉尔', '河源', '锦州', '广元', '柳州', '银川', '三沙', '长沙', '吉林', '乌兰察布', '益阳', '邯郸', '济源', '中卫', '和田地区', '五指山', '阿里地区', '临高县', '平顶山', '济宁', '临汾', '呼伦贝尔', '双鸭山'}, {'本溪', '达州', '甘南藏族自治州', '文山壮族苗族自治州', '泸州', '威海', '玉树藏族自治州', '九江', '合肥', '娄底', '朔州', '白城', '保定', '开封', '承德', '嘉峪关', '襄樊', '孝感', '惠州', '永州', '雅安', '乌海', '苏州', '通辽', '大连', '湛江', '湘潭', '衡阳', '阳泉', '肇庆', '嘉兴', '齐齐哈尔', '石家庄', '定安县', '郑州', '德州', '上海', '枣庄', '漳州', '潮州', '云浮', '武威', '马鞍山', '西宁', '芜湖', '鹰潭', '锡林郭勒盟', '金华', '桂林', '温州', '德宏傣族景颇族自治州', '绥化', '三明', '新乡', '东莞', '扬州', '朝阳', '廊坊', '安阳', '眉山', '乐山', '岳阳', '阜新', '南阳', '大理白族自治州', '汕头', '赣州', '黄南藏族自治州', '深圳', '六安', '南昌', '宜昌', '亳州', '黔东南苗族侗族自治州', '陵水黎族自治县', '玉溪', '成都', '黄山', '蚌埠', '河池', '日照', '营口', '泰州', '贵阳', '七台河', '酒泉', '澄迈县', '怀化', '呼和浩特', '淮安', '伊春', '阜阳', '鹤岗', '天津', '六盘水', '延边朝鲜族自治州', '郴州', '大兴安岭地区', '澳门', '宁德', '丽水', '荆州', '邢台', '迪庆藏族自治州', '昭通', '黑河', '北海', '葫芦岛', '鹤壁', '果洛藏族自治州', '丽江', '天门', '商丘', '常州', '乌鲁木齐', '中山', '拉萨', '贺州', '绍兴', '佳木斯', '襄阳', '南京', '淮南', '滁州', '百色', '西安', '渭南', '资阳', '张掖', '阳江', '神农架林区', '德阳', '巴音郭楞蒙古自治州', '信阳', '来宾', '儋州', '许昌', '仙桃', '天水', '琼中黎族苗族自治县', '江门', '厦门', '哈密', '阿拉善盟', '邵阳', '衢州', '南充', '丹东', '泉州', '烟台', '汕尾', '常德', '四平', '黔西南布依族苗族自治州', '梧州', '临沂', '黔南布依族苗族自治州', '哈尔滨', '盘锦', '定西', '昆玉', '连云港', '台州', '大同', '安庆', '盐城', '潍坊', '金昌', '咸宁', '咸阳', '重庆', '佛山', '东方', '焦作', '衡水', '广州', '张家口', '宿迁', '崇左', '潜江', '红河哈尼族彝族自治州', '东营', '湖州', '珠海', '乐东黎族自治县', '白沙黎族自治县', '忻州', '北京', '景德镇', '濮阳', '宝鸡', '海口', '杭州', '漯河', '商洛', '吴忠', '绵阳', '海东', '南通', '无锡', '济南', '随州', '吕梁', '龙岩', '鞍山', '韶关', '周口', '遵义', '松原', '赤峰', '思茅', '太原', '清远', '黄冈', '防城港', '通化', '伊犁哈萨克自治州', '阿克苏地区', '玉林', '香港', '铁岭', '昌江黎族自治县', '昆明', '聊城', '驻马店', '菏泽', '池州', '三门峡', '曲靖', '巴中', '株洲', '淮北', '阿坝藏族羌族自治州', '上饶', '泰安', '晋中', '安顺', '榆林', '长治', '普洱', '遂宁', '宁波', '白山', '大庆', '钦州', '晋城', '牡丹江', '石嘴山', '十堰', '汉中', '延安', '吉安', '贵港', '辽阳', '恩施土家族苗族自治州', '博尔塔拉蒙古自治州', '镇江', '宣城', '毕节', '揭阳', '茂名', '宜春', '南平', '庆阳', '梅州', '兰州', '广安', '抚州', '荆门', '湘西土家族苗族自治州', '沧州', '秦皇岛', '青岛', '滨州', '琼海', '宿州', '包头', '铜川', '攀枝花', '巴彦淖尔', '鄂尔多斯', '甘孜藏族自治州', '三亚', '凉山彝族自治州', '长春', '徐州', '抚顺', '安康', '辽源', '万宁', '图木舒克', '临夏回族自治州', '海西蒙古族藏族自治州', '沈阳', '南宁', '洛阳', '铜仁', '陇南', '白银', '福州', '兴安盟', '运城', '萍乡', '黄石', '唐山', '喀什地区', '武汉', '平凉', '楚雄彝族自治州', '淄博', '文昌', '河源', '锦州', '广元', '柳州', '银川', '长沙', '吉林', '乌兰察布', '益阳', '邯郸', '济源', '中卫', '和田地区', '临高县', '济宁', '平顶山', '临汾', '呼伦贝尔'}, {'赣州', '烟台', '常德', '钦州', '四平', '黔西南布依族苗族自治州', '梧州', '深圳', '晋城', '六安', '牡丹江', '临沂', '达州', '南昌', '宜昌', '十堰', '黔南布依族苗族自治州', '甘南藏族自治州', '汉中', '亳州', '泸州', '吉安', '哈尔滨', '贵港', '自贡', '连云港', '台州', '黔东南苗族侗族自治州', '陵水黎族自治县', '九江', '大同', '安庆', '盐城', '昌都', '潍坊', '合肥', '成都', '娄底', '舟山', '黄山', '蚌埠', '河池', '宣城', '固原', '毕节', '揭阳', '茂名', '日照', '重庆', '保定', '承德', '那曲', '佛山', '贵阳', '宜春', '东方', '七台河', '南平', '襄樊', '焦作', '孝感', '衡水', '酒泉', '惠州', '广州', '永州', '梅州', '张家口', '庆阳', '怀化', '宿迁', '崇左', '雅安', '东营', '潜江', '苏州', '通辽', '乐东黎族自治县', '珠海', '湖州', '兰州', '淮安', '广安', '伊春', '忻州', '阜阳', '北京', '抚州', '大连', '天津', '荆门', '湘西土家族苗族自治州', '湛江', '郴州', '湘潭', '延边朝鲜族自治州', '衡阳', '濮阳', '青岛', '滨州', '景德镇', '阳泉', '琼海', '宿州', '肇庆', '包头', '宁德', '嘉兴', '海口', '荆州', '杭州', '邢台', '攀枝花', '昭通', '鄂尔多斯', '甘孜藏族自治州', '三亚', '吴忠', '凉山彝族自治州', '绵阳', '北海', '葫芦岛', '徐州', '石家庄', '南通', '无锡', '济南', '安康', '吕梁', '龙岩', '郑州', '万宁', '德州', '上海', '韶关', '周口', '遵义', '临夏回族自治州', '松原', '沈阳', '漳州', '南宁', '天门', '洛阳', '赤峰', '沧州', '铜仁', '陇南', '新余', '保亭黎族苗族自治县', '太原', '福州', '黄冈', '商丘', '常州', '运城', '潮州', '萍乡', '防城港', '唐山', '中山', '云浮', '武汉', '拉萨', '平凉', '贺州', '马鞍山', '玉林', '绍兴', '香港', '淄博', '林芝', '襄阳', '西宁', '南京', '鹰潭', '昌江黎族自治县', '锡林郭勒盟', '淮南', '滁州', '百色', '金华', '西安', '昆明', '聊城', '张掖', '宜宾', '阳江', '河源', '桂林', '温州', '德宏傣族景颇族自治州', '锦州', '广元', '柳州', '信阳', '来宾', '驻马店', '儋州', '菏泽', '仙桃', '银川', '三门峡', '巴中', '三明', '株洲', '新乡', '东莞', '扬州', '淮北', '天水', '上饶', '长沙', '泰安', '朝阳', '吉林', '晋中', '安顺', '乌兰察布', '江门', '廊坊', '厦门', '益阳', '邯郸', '榆林', '安阳', '济源', '眉山', '阿拉善盟', '长治', '内江', '邵阳', '临高县', '济宁', '平顶山', '南充', '鸡西', '临汾', '呼伦贝尔', '乐山', '宁波', '南阳', '阜新', '汕头', '泉州', '双鸭山', '大庆'}, {'赣州', '汕尾', '钦州', '四平', '铜陵', '黔西南布依族苗族自治州', '梧州', '深圳', '六安', '宜昌', '十堰', '文山壮族苗族自治州', '亳州', '威海', '吉安', '哈尔滨', '贵港', '定西', '保山', '台州', '连云港', '黔东南苗族侗族自治州', '恩施土家族苗族自治州', '大同', '屯昌县', '安庆', '盐城', '潍坊', '合肥', '成都', '黄山', '蚌埠', '河池', '镇江', '固原', '宣城', '毕节', '揭阳', '茂名', '日照', '重庆', '保定', '泰州', '开封', '承德', '佛山', '宜春', '襄樊', '孝感', '衡水', '惠州', '广州', '永州', '梅州', '张家口', '宿迁', '怀化', '潜江', '呼和浩特', '苏州', '通辽', '湖州', '珠海', '兰州', '乐东黎族自治县', '伊春', '阜阳', '北京', '大连', '天津', '荆门', '怒江傈僳族自治州', '湘西土家族苗族自治州', '郴州', '六盘水', '湛江', '延边朝鲜族自治州', '衡阳', '青岛', '濮阳', '秦皇岛', '滨州', '沧州', '宿州', '肇庆', '嘉兴', '海口', '杭州', '邢台', '齐齐哈尔', '攀枝花', '昭通', '黑河', '三亚', '凉山彝族自治州', '长春', '北海', '鹤壁', '徐州', '西双版纳傣族自治州', '石家庄', '无锡', '辽源', '随州', '吕梁', '郑州', '万宁', '上海', '韶关', '周口', '天门', '沈阳', '南宁', '赤峰', '铜仁', '陇南', '保亭黎族苗族自治县', '清远', '兴安盟', '商丘', '常州', '萍乡', '通化', '唐山', '中山', '临沧', '平凉', '武汉', '贺州', '玉林', '楚雄彝族自治州', '襄阳', '西宁', '芜湖', '南京', '锡林郭勒盟', '淮南', '滁州', '百色', '西安', '金华', '昆明', '聊城', '阳江', '温州', '桂林', '信阳', '柳州', '来宾', '驻马店', '菏泽', '许昌', '池州', '曲靖', '株洲', '新乡', '东莞', '扬州', '淮北', '天水', '上饶', '长沙', '廊坊', '乌兰察布', '江门', '张家界', '邯郸', '安阳', '中卫', '长治', '邵阳', '衢州', '临汾', '鸡西', '宁波', '白山', '大理白族自治州', '丹东', '泉州'}, {'赣州', '烟台', '汕尾', '常德', '梧州', '深圳', '六安', '临沂', '宜昌', '亳州', '威海', '盘锦', '贵港', '连云港', '黔东南苗族侗族自治州', '恩施土家族苗族自治州', '大同', '盐城', '潍坊', '成都', '镇江', '宣城', '揭阳', '朔州', '茂名', '重庆', '营口', '开封', '佛山', '惠州', '永州', '广州', '张家口', '庆阳', '怀化', '宿迁', '潜江', '东营', '呼和浩特', '苏州', '通辽', '珠海', '淮安', '忻州', '阜阳', '北京', '大连', '荆门', '丹东', '湘西土家族苗族自治州', '延边朝鲜族自治州', '郴州', '湛江', '秦皇岛', '青岛', '衡阳', '滨州', '阳泉', '包头', '嘉兴', '丽水', '荆州', '杭州', '巴彦淖尔', '甘孜藏族自治州', '长春', '葫芦岛', '鹤壁', '徐州', '无锡', '济南', '辽源', '鞍山', '德州', '上海', '韶关', '枣庄', '周口', '沈阳', '天门', '赤峰', '南宁', '铜仁', '太原', '清远', '商丘', '运城', '通化', '中山', '武汉', '贺州', '玉林', '香港', '绍兴', '淄博', '芜湖', '南京', '淮南', '滁州', '金华', '西安', '渭南', '宜宾', '阳江', '温州', '桂林', '信阳', '菏泽', '许昌', '三门峡', '株洲', '新乡', '东莞', '扬州', '长沙', '泰安', '乌兰察布', '江门', '张家界', '邵阳', '济宁', '岳阳', '宁波', '汕头'}, {'怀化', '汕尾', '上海', '韶关', '苏州', '黔西南布依族苗族自治州', '深圳', '湖州', '珠海', '黔南布依族苗族自治州', '铜仁', '淮安', '阜阳', '东莞', '扬州', '清远', '贵港', '潮州', '永州', '长沙', '萍乡', '安顺', '郴州', '湛江', '六盘水', '衡阳', '舟山', '镇江', '嘉兴', '绍兴', '宣城', '揭阳', '内江', '重庆', '佛山', '贵阳', '徐州', '惠州', '资阳', '汕头', '阳江', '广州', '河源'}, {'梅州', '赣州', '佛山', '云浮', '东莞', '贵港', '潮州', '深圳', '揭阳', '茂名', '珠海', '汕头', '湛江', '阳江', '广州', '河源'}, {'南京', '宿迁', '枣庄', '徐州', '连云港', '泰州', '无锡', '济南', '日照', '临沂', '盐城', '潍坊', '青岛', '济宁'}, {'东营', '枣庄', '日照', '济南', '临沂', '潍坊', '青岛'}, {'巴中', '成都', '凉山彝族自治州', '广元', '自贡', '宜宾', '达州', '昭通'}, {'盐城', '上海', '苏州', '北京', '杭州', '衡水', '宁波', '南通', '湖州', '廊坊', '沧州', '泰州'}, {'南京', '上海', '苏州', '常州', '嘉兴', '宁波', '湖州', '泰州', '无锡', '盐城'}, {'北京', '衡水', '保定', '沧州', '唐山'}, {'邯郸', '德州', '北京', '衡水', '石家庄'}, {'合肥', '芜湖', '安庆', '滁州'}, {'杭州', '宁波', '台州', '绍兴'}, {'钦州', '南宁', '河池'}, {'长沙', '常德', '衡阳'}, {'嘉兴', '苏州', '南通'}, {'成都', '南充', '遂宁'}, {'平顶山', '商丘', '郑州'}, {'焦作', '商丘', '郑州'}, {'成都', '乐山', '南充'}, {'武汉', '鄂州'}]
# X = [0.   0.01 0.02 0.03 0.04 0.05 0.06 0.07 0.08 0.09 0.1  0.11 0.12 0.130.14 0.15 0.16 0.17 0.18 0.19 0.2  0.21 0.22 0.23 0.24]




